EmbeddedInsights/hal_nxp/dts/nxp/kinetis/MK70FN1M0-pinctrl.h
#define ADC0_DP2_PTE2 		KINETIS_MUX('E',2,0) /* PTE2 */
#define ADC1_SE6a_PTE2 		KINETIS_MUX('E',2,0) /* PTE2 */
#define LLWU_P1_PTE2 		KINETIS_MUX('E',2,1) /* PTE2 */
#define PTE2 				KINETIS_MUX('E',2,1) /* PTE2 */
#define SPI1_SCK_PTE2 KINETIS_MUX('E',2,2) /* PTE2 */
#define UART1_CTS_b_PTE2 KINETIS_MUX('E',2,3) /* PTE2 */
#define SDHC0_DCLK_PTE2 KINETIS_MUX('E',2,4) /* PTE2 */
#define TRACE_D2_PTE2 KINETIS_MUX('E',2,5) /* PTE2 */
#define ADC1_SE7a_PTE3 KINETIS_MUX('E',3,0) /* PTE3 */
#define ADC0_DM2_PTE3 KINETIS_MUX('E',3,0) /* PTE3 */
#define PTE3 KINETIS_MUX('E',3,1) /* PTE3 */
#define SPI1_SIN_PTE3 KINETIS_MUX('E',3,2) /* PTE3 */
#define UART1_RTS_b_PTE3 KINETIS_MUX('E',3,3) /* PTE3 */
#define SDHC0_CMD_PTE3 KINETIS_MUX('E',3,4) /* PTE3 */
#define TRACE_D1_PTE3 KINETIS_MUX('E',3,5) /* PTE3 */
#define SPI1_SOUT_PTE3 KINETIS_MUX('E',3,7) /* PTE3 */
#define LLWU_P2_PTE4 KINETIS_MUX('E',4,1) /* PTE4 */
#define PTE4 KINETIS_MUX('E',4,1) /* PTE4 */
#define SPI1_PCS0_PTE4 KINETIS_MUX('E',4,2) /* PTE4 */
#define UART3_TX_PTE4 KINETIS_MUX('E',4,3) /* PTE4 */
#define SDHC0_D3_PTE4 KINETIS_MUX('E',4,4) /* PTE4 */
#define TRACE_D0_PTE4 KINETIS_MUX('E',4,5) /* PTE4 */
#define PTE5 KINETIS_MUX('E',5,1) /* PTE5 */
#define SPI1_PCS2_PTE5 KINETIS_MUX('E',5,2) /* PTE5 */
#define UART3_RX_PTE5 KINETIS_MUX('E',5,3) /* PTE5 */
#define SDHC0_D2_PTE5 KINETIS_MUX('E',5,4) /* PTE5 */
#define FTM3_CH0_PTE5 KINETIS_MUX('E',5,6) /* PTE5 */
#define PTE6 KINETIS_MUX('E',6,1) /* PTE6 */
#define SPI1_PCS3_PTE6 KINETIS_MUX('E',6,2) /* PTE6 */
#define UART3_CTS_b_PTE6 KINETIS_MUX('E',6,3) /* PTE6 */
#define I2S0_MCLK_PTE6 KINETIS_MUX('E',6,4) /* PTE6 */
#define FTM3_CH1_PTE6 KINETIS_MUX('E',6,6) /* PTE6 */
#define USB_SOF_OUT_PTE6 KINETIS_MUX('E',6,7) /* PTE6 */
#define PTE7 KINETIS_MUX('E',7,1) /* PTE7 */
#define UART3_RTS_b_PTE7 KINETIS_MUX('E',7,3) /* PTE7 */
#define I2S0_RXD0_PTE7 KINETIS_MUX('E',7,4) /* PTE7 */
#define FTM3_CH2_PTE7 KINETIS_MUX('E',7,6) /* PTE7 */
#define PTE8 KINETIS_MUX('E',8,1) /* PTE8 */
#define I2S0_RXD1_PTE8 KINETIS_MUX('E',8,2) /* PTE8 */
#define UART5_TX_PTE8 KINETIS_MUX('E',8,3) /* PTE8 */
#define I2S0_RX_FS_PTE8 KINETIS_MUX('E',8,4) /* PTE8 */
#define FTM3_CH3_PTE8 KINETIS_MUX('E',8,6) /* PTE8 */
#define PTE9 KINETIS_MUX('E',9,1) /* PTE9 */
#define I2S0_TXD1_PTE9 KINETIS_MUX('E',9,2) /* PTE9 */
#define UART5_RX_PTE9 KINETIS_MUX('E',9,3) /* PTE9 */
#define I2S0_RX_BCLK_PTE9 KINETIS_MUX('E',9,4) /* PTE9 */
#define FTM3_CH4_PTE9 KINETIS_MUX('E',9,6) /* PTE9 */
#define PTE10 KINETIS_MUX('E',10,1) /* PTE10 */
#define UART5_CTS_b_PTE10 KINETIS_MUX('E',10,3) /* PTE10 */
#define I2S0_TXD0_PTE10 KINETIS_MUX('E',10,4) /* PTE10 */
#define FTM3_CH5_PTE10 KINETIS_MUX('E',10,6) /* PTE10 */
#define PTE11 KINETIS_MUX('E',11,1) /* PTE11 */
#define UART5_RTS_b_PTE11 KINETIS_MUX('E',11,3) /* PTE11 */
#define I2S0_TX_FS_PTE11 KINETIS_MUX('E',11,4) /* PTE11 */
#define FTM3_CH6_PTE11 KINETIS_MUX('E',11,6) /* PTE11 */
#define PTE12 KINETIS_MUX('E',12,1) /* PTE12 */
#define I2S0_TX_BCLK_PTE12 KINETIS_MUX('E',12,4) /* PTE12 */
#define FTM3_CH7_PTE12 KINETIS_MUX('E',12,6) /* PTE12 */

#define UART2_TX_PTE16 KINETIS_MUX('E',16,3) /* PTE16 */
#define UART2_RX_PTE17 KINETIS_MUX('E',17,3) /* PTE17 */

#define ADC0_SE17_PTE24 KINETIS_MUX('E',24,0) /* PTE24 */
#define PTE24 KINETIS_MUX('E',24,1) /* PTE24 */
#define UART4_TX_PTE24 KINETIS_MUX('E',24,3) /* PTE24 */
#define I2C0_SCL_PTE24 KINETIS_MUX('E',24,5) /* PTE24 */
#define EWM_OUT_b_PTE24 KINETIS_MUX('E',24,6) /* PTE24 */
#define ADC0_SE18_PTE25 KINETIS_MUX('E',25,0) /* PTE25 */
#define PTE25 KINETIS_MUX('E',25,1) /* PTE25 */
#define UART4_RX_PTE25 KINETIS_MUX('E',25,3) /* PTE25 */
#define I2C0_SDA_PTE25 KINETIS_MUX('E',25,5) /* PTE25 */
#define EWM_IN_PTE25 KINETIS_MUX('E',25,6) /* PTE25 */
#define PTE26 KINETIS_MUX('E',26,1) /* PTE26 */
#define ENET_1588_CLKIN_PTE26 KINETIS_MUX('E',26,2) /* PTE26 */
#define UART4_CTS_b_PTE26 KINETIS_MUX('E',26,3) /* PTE26 */
#define RTC_CLKOUT_PTE26 KINETIS_MUX('E',26,6) /* PTE26 */
#define USB_CLKIN_PTE26 KINETIS_MUX('E',26,7) /* PTE26 */
#define PTE27 KINETIS_MUX('E',27,1) /* PTE27 */
#define UART4_RTS_b_PTE27 KINETIS_MUX('E',27,3) /* PTE27 */
#define PTE28 KINETIS_MUX('E',28,1) /* PTE28 */
#endif
